Catalogs/НастройкиУчетаЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>НастройкиУчетаЗатрат</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БазаРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БазыРаспределенияКосвенныхРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПланСчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОсобыеПравилаРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазаРаспределения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.БазыРаспределенияКосвенныхРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписокСтатейЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СписокСтатейЗатратВключенныхВБазуРаспределенияКосвенныхРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетПрямыхЗатрат</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НастройкиУчетаЗатрат/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Устанавливает наименование элемента справочника из контекста его применения.
// Следует применять, если каждой записи учетной политики соответствует отдельный элемент справочника.
//
// Параметры:
//  ЗаписьУчетнойПолитики - РегистрСведенийМенеджерЗаписи.УчетнаяПолитика - учетная политика, частью которой является настройка
//
Процедура УстановитьНаименованиеПоКонтексту(ЗаписьУчетнойПолитики) Экспорт
	
	Если Не ЗначениеЗаполнено(ЗаписьУчетнойПолитики.Организация) И Не ЗначениеЗаполнено(ЗаписьУчетнойПолитики.Период) Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеПоКонтексту = СтрШаблон(
		НСтр("ru = '%1, %2'", ОбщегоНазначения.КодОсновногоЯзыка()),
		Формат(ЗаписьУчетнойПолитики.Период, "ДЛФ=D"),
		ЗаписьУчетнойПолитики.Организация);
		
	Если НаименованиеПоКонтексту = Наименование Тогда
		Возврат;
	КонецЕсли;
	
	Наименование = НаименованиеПоКонтексту;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	НастройкиЗаполнения = Неопределено;
	
	Если ДанныеЗаполнения = Неопределено Тогда
		НастройкиЗаполнения = Справочники.НастройкиУчетаЗатрат.НовыйБазовыеНастройкиУчетаЗатрат();
		Справочники.НастройкиУчетаЗатрат.ЗаполнитьПоУмолчанию(НастройкиЗаполнения);
	ИначеЕсли Справочники.НастройкиУчетаЗатрат.ЭтоНастройкиУчетаЗатрат(ДанныеЗаполнения) Тогда
		НастройкиЗаполнения = ДанныеЗаполнения;
	КонецЕсли;
	
	Если НастройкиЗаполнения <> Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПланСчетов.Очистить();
		Для Каждого СчетУчета Из НастройкиЗаполнения.СчетаУчета Цикл
			ПланСчетов.Добавить().СчетУчета = СчетУчета;
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиЗаполнения, "БазаРаспределения");
		
		ОсобыеПравилаРаспределения.Загрузить(НастройкиЗаполнения.ОсобыеПравилаРаспределения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
